typedef struct { uint16_t freq; uint16_t ms; } my_note_t;

const my_note_t melody[] = {
{587, 300}, // D5  (레)
  {523, 300}, // C5  (도)
  {494, 300}, // B4  (시)
  {440, 300}, // A4  (라)

  {659, 300}, // E5  (미)
  {740, 300}, // F#5 (파#)
  {659, 300}, // E5  (미)

  {587, 300}, // D5  (레)
  {494, 300}, // B4  (시)
  {392, 300}, // G4  (솔)

  {392, 300}, // G4  (솔)
  {440, 300}, // A4  (라)
  {494, 300}, // B4  (시)

  {523, 300}, // C5  (도)
  {370, 300}, // F#4 (파#)
  {392, 300}, // G4  (솔)
  {440, 300}, // A4  (라)

  {587, 300}, // D5  (레)
  {523, 300}, // C5  (도)
  {494, 300}, // B4  (시)
  {440, 300}, // A4  (라)

  {587, 300}, // D5  (레)
  {523, 300}, // C5  (도)
  {494, 300}, // B4  (시)
  {587, 300}, // D5  (레)

  {784, 300}, // G5  (높은 솔)
  {740, 300}, // F#5 (높은 파#)
  {740, 300}, // F#5 (높은 파#)
  {784, 300}, // G5  (높은 솔)
  {659, 300}, // E5  (미)

  {587, 300}, // D5  (레)
  {523, 300}, // C5  (도)
  {494, 300}, // B4  (시)
  {440, 300}, // A4  (라)
  {392, 300},  // G4  (솔)
};
const int N = sizeof(melody) / sizeof(melody[0]);
const int PIN_BUZ = 14;

void setup() {
    ledcAttach(PIN_BUZ, 1000, 10);
}

void loop() {
    for (int i = 0; i < N; i++) {
        ledcWriteTone(PIN_BUZ, melody[i].freq);
        delay(melody[i].ms);
    }
    ledcWriteTone(PIN_BUZ, 0);            // 0 Hz = 소리 끄기
    delay(2000);
}